In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure

In [2]:
#given dataset
df_old = pd.DataFrame({"Salary": [1,2,3,4,5,40,6,7,8,9,10,20]})
df_old

    Salary
0        1
1        2
2        3
3        4
4        5
5       40
6        6
7        7
8        8
9        9
10      10
11      20

Here 1st we'll find the mean & std deviation of this col then we'll set a range mean +_ std deviation, if an entry lies beyond that range its considered an outlier Then we'll drop those entire rows

Theory & reasoning We know that in Std normal distribution mean = 0 & std = 1 so any val that isnt in -1std to +1std range is considered an outlier

In [3]:
mean = np.mean(df_old["Salary"])
sd = np.std(df_old["Salary"])

In [4]:
mean

9.583333333333334

In [5]:
sd

10.339715770862476

In [6]:
[mean-sd,mean+sd]

[-0.7563824375291421, 19.92304910419581]

ie if a value is NOT in this range then it's an OUTLIER

In [7]:
for i in range(len(df_old["Salary"])): # for each 
    if df_old["Salary"].loc[i] > mean+sd or df_old["Salary"].loc[i] < mean-sd: # if that value doesnt belong in range mean +_ std
        df = df_old.drop([i]) #drop that entire ith row
        
df

    Salary
0        1
1        2
2        3
3        4
4        5
5       40
6        6
7        7
8        8
9        9
10      10

debug the code  for errors